{
  "data": [
    {
      "title": "Definisi, dalil, dan hikmah haid",
      "paragraphs": [
        {
          "context": "Definisi haid dari segi syariat adalah darah alami, keluar dari rahim wanita yang terdalam, dengan cara yang normal, tanpa ada sebab, di masa tertentu. Penjelasan definisi haid di atas mengandung 4 hal yaitu Haid adalah darah alami, maksudnya biasa dialami oleh wanita normal. Haid keluar dari rahim wanita yang terdalam dan terjauh. Haid adalah darah yang keluar dengan cara yang normal tanpa ada sebab, lain halnya dengan darah nifas dan istihadah. Haid memiliki masa tertentu, yaitu masa minimal haid, masa maksimal, dan masa rata-rata. Dalil tentang haid adalah firman Allah artinya: \"Mereka bertanya kepadamu tentang haid. Katakanlah 'Haid itu adalah kotoran.' Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haid dan janganlah kamu mendekati mereka sebelum mereka suci. Apabila mereka telah suci, maka campurilah mereka itu di tempat yang diperintahkan Allah kepadamu. Sungguh Allah menyukai orang yang bertaubat dan menyucikan dirinya.\" Di dalam ayat ini Allah menjelaskan tentang hukum haid. Pertama yaitu darah haid adalah najis berdasarkan firman Allah, 'Katakanlah haid itu adalah kotoran.' Kemudian diperintahkan kepada para suami untuk menjauhi wanita ketika haid. Maksudnya menjauhi dalam menyentuh wanita antara pusar dan lutut. Makna menjauhi disini bukanlah memisahkan wanita dalam makan, minum, dan tempat tinggal. Karena hal itu adalah kebiasaan orang yahudi. Hikmah Haid: haid adalah perkara yang Allah tetapkan sebagai ujian para wanita. Di dalam sahih disebutkan bahwa Aisyah r.a. berkata, Rasulullah SAW bersabda artinya: Sesungguhnya perkara ini telah Allah tetapkan bagi wanita.",
          "qas": []
        }
      ]
    },
    {
      "title": "Definisi, dalil, dan masa nifas",
      "paragraphs": [
        {
          "context": "Definisi nifas segi bahasa: melahirkan. Definisi nifas segi istilah adalah darah yang keluar setelah rahim kosong dari kehamilan. Penjelasan: walaupun yang keluar dari perut adalah segumpal darah atau daging yang bentuknya tak jelas. Asalkan bidan mengatakan bahwa gumpalan itu adalah awal bentuk manusia. Dan cukuplah informasi dari seorang bidan. Dinamakan nifas karena darah ini keluar setelah melahirkan. Dalil tentang Nifas yaitu Ummu Salamah r.a. berkata artinya: \"Para wanita yang sedang nifas di zaman Rasulullah berdiam di rumahnya selama 40 hari atau 40 malam.\" Hadis ini menjadi dalil masa rata-rata nifas yaitu 40 hari. Sedangkan masa minimal nifas adalah sekejap dan maksimal 60 hari. Pendapat paling kuat: Masa nifas dimulai sejak darah keluar. Ini adalah dari segi hukum. Sedangkan dari segi jumlah hari sejak rahim kosong dari kehamilan. Contoh seorang wanita mengeluarkan darah nifas di hari ke-10 setelah melahirkan. Dari segi jumlah hari maka ia telah mengalami nifas selama 10 hari. Sedangkan dari segi hukum nifasnya dimulai sejak ia mengeluarkan darah. Maka 10 hari sebelumnya ia dihukumi suci. Jika darah yang keluar melebihi 60 hari, maka dilihat masa sejenak setelah sempurnanya 60 hari. Jika di masa tersebut terdapat darah maka ia mengalami istihadah di dalam nifas yang dikembalikan ke salah satu dari 7 macam istihadah. Namun jika di masa sejenak tersebut tak terdapat darah, maka darah yang keluar setelahnya terhitung haid jika mencapai sehari semalam. Karena darah yang keluar melebihi masa maksimal nifas, maka sejenak setelahnya cukup menjadi masa suci di antara nifas dan haid.",
          "qas": []
        }
      ]
    },
    {
      "title": "Definisi dan dalil istihadah",
      "paragraphs": [
        {
          "context": "Definisi istihadah adalah darah yang keluar dari bagian rahim terluar di selain hari-hari haid dan nifas. Penjelasan: macam darah ketiga dan terakhir yang keluar dari kemaluan adalah darah istihadah. Juga disebut sebagai darah penyakit. Yaitu darah yang keluar dari bagian rahim terluar. Berbeda dengan haid. Haid keluar dari bagian rahim terdalam. Darah istihadah keluar di selain hari haid dan nifas. Maksudnya adalah selain darah haid dan nifas. Maka kita tidak bisa menghukumi setiap darah yang keluar adalah haid atau nifas. Mungkin saja darah tersebut adalah istihadah yang memiliki hukum tersendiri. Dalil tentang istihadah: Hadis diriwayatkan oleh Fatimah binti Abi Hubaisy. Suatu ketika ia mengalami istihadah. Rasulullah SAW berkata kepadanya artinya: \"Jika darah haid maka warnanya hitam sebagaimana yang diketahui. Jika seperti itu maka janganlah melakukan salat. Jika darahnya berbeda maka berwudhulah dan salatlah karena itu adalah 'irq (istihadah).\" Nabi Muhammad SAW telah menjelaskan perbedaan antara darah haid dengan darah istihadah dari segi sifat darah. Darah istihadah berasal dari 'irq atau disebut 'adzil. Sedangkan darah haid berasal dari dasar rahim (rahim yang terdalam).",
          "qas": []
        }
      ]
    },
    {
      "title": "Cairan kewanitaan, madzi, dan hukumnya",
      "paragraphs": [
        {
          "context": "Cairan yang keluar dari kemaluan selain darah adalah rotubatul farj (cairan di vagina). Yaitu cairan putih antara madzi dan keringat. Kesimpulan hukumnya: Jika keluar dari bagian luar vagina maka tidak najis dan tidak membatalkan wudhu. Jika keluar dari bagian dalam vagina maka najis dan membatalkan wudhu. Jika ragu apakah keluar dari bagian dalam atau luar maka tidak najis dan tidak membatalkan wudhu. Bagian luar yaitu bagian yang wajib dibasuh ketika mandi besar dan istinja'. Bagian dalam yaitu sebaliknya. Dalilnya: Ulama bersepakat bahwa madzi najis dan membatalkan wudhu. Madzi keluar dari bagian dalam vagina. Maka jika rotubatul farj ini keluar dari bagian dalam vagina, hukumnya seperti madzi. Jika keluar dari bagian luar vagina maka menyerupai keringat. Sedangkan keringat hukumnya suci dan tak membatalkan wudhu. Ketika ragu maka keyakinan tak dapat dihilangkan dengan keraguan. Karena asalnya ia dalam keadaan suci dan tidak membatalkan wudhu.",
          "qas": []
        }
      ]
    },
    {
      "title": "Tanda balig, usia minimal, dan sifat darah haid",
      "paragraphs": [
        {
          "context": "Usia minimal seorang wanita mengalami haid adalah kira-kira usia 9 tahun berdasarkan tahun hijriah. Makna kira-kira adalah masa tak cukup untuk haid dan suci yaitu kurang dari 16 hari. Sedangkan jika memenuhi masa minimal suci dan haid, yaitu 16 hari atau lebih, maka darah tersebut adalah istihadah. Tidak ada usia maksimal seorang wanita mengalami haid. Selama wanita masih hidup maka ia masih mungkin mengalami haid. Namun rata-rata wanita mengalami menopause (berhenti dari haid) ketika mencapai usia 62 tahun. Usia balig adalah seorang laki-laki atau wanita yang telah mencapai batasan dalam mengemban tanggung jawab syariat baik dari salat, puasa, haji, dan lain-lain. Tanda-tanda balig: keluarnya darah haid bagi seorang wanita setelah ia berusia kira-kira 9 tahun hijriyah, keluarnya mani bagi laki-laki dan wanita setelah ia berusia kira-kira 9 tahun hijriyah menurut Ibnu Hajar dan tepat 9 tahun menurut Imam Romli, sempurna mencapai usia 15 tahun (memasuki usia 16 tahun berdasarkan perhitungan tahun hijriyah) jika ia tak mengalami haid atau keluar mani. Darah haid memiliki beragam sifat yaitu hitam, merah, coklat, kuning, keruh (antara kuning dan putih). Dan terkadang darah tersebut kental dan berbau tak enak. Pendapat paling kuat para ulama Syafi'i adalah darah kuning dan keruh termasuk jenis darah haid. Sebagaimana hadis riwayat Bukhori ketika para wanita mengutus seseorang kepada Aisyah r.a. dengan membawa kapas yang mengandung darah kekuning-kuningan. Beliau berkata, \"Jangan terburu-buru hingga kalian melihat kapas tersebut bersih (berwarna putih).\"",
          "qas": []
        }
      ]
    },
    {
      "title": "Masa haid dan masa suci antara dua haid",
      "paragraphs": [
        {
          "context": "Haid memiliki masa minimal, maksimal, dan masa rata-rata. Masa minimal: sehari semalam atau 24 jam. Batasan: tampak darah di kemaluan luar. Jika kapas dimasukkan ke dalam kemaluan, maka menjadi kotor. Masa minimal terbagi dua. Pertama, darah keluar terus-menerus selama 24 jam. Kedua, darah keluar terputus-putus. Misalnya darah berhenti selama 1 jam, lalu 1 jam berikutnya darah keluar. Akan tetapi total waktu darah keluar adalah 24 jam di dalam rentang 15 hari. Maka keseluruhan darah terhitung haid. Masa maksimal: 15 hari 15 malam. Masa rata-rata: 6 atau 7 hari. Dalilnya penelitian yang dilakukan Imam Syafi'i yaitu dengan melakukan pengamatan pada kasus-kasus yang terjadi dan menyimpulkannya. Jika ia mengeluarkan darah lebih dari 15 hari 15 malam, maka ia mengalami istihadah. Maka tak ada perbedaan pendapat di dalam madzhab bahwa ketika ia mengeluarkan darah dihukumi haid. Dan ketika suci, ia wajib mandi, salat, dan puasa, serta boleh berhubungan suami istri. Karena saat itu ia jelas dalam keadaan suci dan tak akan mengeluarkan darah lagi. Perbedaan yang muncul adalah masa suci di antara dua darah haid. Pendapat paling kuat menganggapnya haid dengan syarat-syarat: total darah keluar dan masa suci tak lebih dari 15 hari, serta total waktu mengeluarkan darah lebih dari 24 jam. Jika total darah tersebut kurang dari 24 jam maka termasuk istihadah. Masa minimal suci di antara dua haid adalah 15 hari. Jika masa maksimal haid adalah 15 hari maka masa minimal suci juga 15 hari. Karena kebanyakan wanita dalam sebulan mengalami haid dan suci. Masa rata-rata suci di antara dua haid adalah sisa hari dalam bulan tersebut setelah masa rata-rata haid. Tak ada batasan di masa maksimal suci. Kadang-kadang seorang wanita seumur hidupnya hanya mengalami haid sekali atau sama sekali tak mengalami haid.",
          "qas": []
        }
      ]
    },
    {
      "title": "Darah haid saat hamil",
      "paragraphs": [
        {
          "context": "Seorang wanita hamil jika ia mengeluarkan darah mencapai sehari semalam, maka pendapat paling kuat dalam madzhab Syafi'i mengatakan ia mengalami haid. Karena banyaknya dalil yang mendukung hal tersebut di antaranya firman Allah SWT yang artinya: katakanlah 'Haid itu adalah kotoran.' Dan hadis Rasulullah yang artinya: sesungguhnya darah haid adalah darah berwarna hitam sebagaimana yang telah diketahui.",
          "qas": []
        }
      ]
    },
    {
      "title": "Kapan dihukumi haid dan suci",
      "paragraphs": [
        {
          "context": "Jika ia mengeluarkan darah di waktu mengalami haid maka ia dihukumi haid. Seorang wanita mubtada'ah (pertama kali mengeluarkan darah) dihukumi haid jika mengeluarkan darah di usia yang memungkinkan untuk mengalami haid yaitu usia 9 tahun qomariyah taqribiyah. Jika ia mu'tadah (pernah mengalami haid dan suci) maka dihukumi haid ketika mengeluarkan darah setelah suci 15 hari atau lebih. Jika masa suci belum mencapai 15 hari, maka darah yang keluar terhitung istihadah. Masa minimal suci harus disempurnakan hingga 15 hari, selebihnya adalah haid yang baru. Ketika seorang wanita dihukumi haid, maka ia wajib menjauhi hal-hal yang diharamkan bagi wanita haid. Seperti puasa, salat dan berhubungan suami istri tanpa menunggu darah mencapai 24 jam karena jelas ia mengalami haid. Kemudian jika ternyata darah yang keluar kurang dari 24 jam, maka ia wajib mengqada puasa dan salat yang ditinggalkan. la tak wajib mandi karena tak mengalami haid. Seorang wanita dihukumi suci dengan berhentinya darah setelah mencapai masa minimal haid. Tandanya adalah kapas bersih dari sisa darah setelah dikeluarkan dari kemaluan. la  wajib mandi, salat, puasa, dan boleh untuk berhubungan suami istri. Jika ia mengeluarkan darah lagi di dalam rentang waktu 15 hari (masa haid) maka ia wajib mengqada puasa saja dan tak berdosa ketika berhubungan suami istri. Karena hukum itu berdasarkan apa yang terjadi, maka ketika darah berhenti, ia dihukumi suci. Jika seorang wanita mempunyai kebiasaan mengeluarkan darah haid lagi setelah berhenti, maka apakah tiap kali darah berhenti ia wajib untuk mandi dan salat? Para ulama Syafi'i berbeda pendapat dalam hal ini. Pendapat Imam Rafi'i: ia tak usah mandi, salat, dan lain-lain. Karena bulan ini dianggap sama dengan sebelumnya. Pendapat Imam Nawawi: ia harus melakukan hal-hal yang dikerjakan oleh wanita suci walaupun mempunyai kebiasaan mengeluarkan darah lagi setelah berhenti. Pendapat yang paling kuat di madzhab Syafi'i seperti pendapat Imam Nawawi. Namun boleh mengamalkan pendapat Imam Rafi'i untuk dirinya sendiri.",
          "qas": []
        }
      ]
    },
    {
      "title": "Syarat nifas dan hukum darah terputus-putus",
      "paragraphs": [
        {
          "context": "Tidaklah dikatakan nifas kecuali memenuhi keempat syarat ini: Darah keluar setelah rahim kosong, Darah keluar sebelum berlalunya 15 hari sejak rahim kosong, Masa suci di antara dua darah nifas tak melebihi 15 hari, Darah yang keluar berada di dalam rentang waktu 60 hari. Jika darah nifas keluar terputus-putus, maka Jika masa suci di antara dua darah adalah 15 hari atau lebih, maka darah kedua adalah haid. Jika masa suci di antara dua darah kurang dari 15 hari, maka ulama bersepakat bahwa ketika ia mengeluarkan darah dihukumi nifas. Sedangkan ketika ia suci terdapat dua pendapat. Pendapat paling kuat: ia dihukumi nifas.",
          "qas": []
        }
      ]
    },
    {
      "title": "Masa Suci Antara Haid dan Nifas",
      "paragraphs": [
        {
          "context": "Seseorang yang hamil bisa mengalami haid menurut pendapat paling kuat. Maka tak ada batasan di masa minimal suci antara haid dan nifas. Bahkan kadang-kadang tak ada masa suci di antara keduanya. Misalnya seorang wanita hamil memiliki kebiasaan haid selama 5 hari. Kemudian di akhir masa haid ia melahirkan. Maka darah yang keluar sebelum melahirkan adalah haid, dan setelahnya adalah nifas. Masa suci di antara nifas dan haid memiliki dua kemungkinan, yaitu: Darah haid keluar sebelum melewati masa maksimal nifas (60 hari) dengan syarat masa suci di antara nifas dan haid adalah 15 hari 15 malam (atau lebih) dan Darah haid keluar setelah melewati masa maksimal nifas (60 hari) maka tak disyaratkan masa suci di antara keduanya 15 hari.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Salat, Kewajiban Qada Salat",
      "paragraphs": [
        {
          "context": "Wanita haid atau nifas haram untuk melakukan salat. Walaupun salat sunnah, jenazah, sujud tilawah, atau sujud syukur. Permasalahan hilangnya penghalang yaitu apabila seorang wanita suci dari haid atau nifas sebelum keluar waktu salat dengan kadar waktu yang cukup untuk melakukan takbiratul ihram atau lebih, maka ia wajib mengqada salat tersebut dengan 2 syarat yaitu bebas dari penghalang dalam kadar waktu yang cukup untuk bersuci dan melakukan syarat salat lainnya (misalnya menutup aurat), bebas dari penghalang dalam kadar waktu yang cukup untuk melakukan salat yang seringkas mungkin. Makna penghalang: haid, nifas, gila, mabuk, pingsan, dan lain-lain. Wajib pula mengqada salat sebelumnya jika dapat dijamak dengannya. Misalnya salat dhuhur dengan ashar dan maghrib dengan isya. Dengan syarat bebas dari penghalang dalam kadar waktu yang cukup untuk bersuci dan melakukan 2 salat fardhu yang seringkas mungkin. Permasalahan datangnya penghalang yaitu jika seorang wanita mengalami haid atau nifas di awal atau pertengahan waktu, maka ia wajib mengqada salat tersebut setelah suci. Dengan syarat ia mengalami haid atau nifas beberapa saat setelah memasuki waktu salat. Yaitu dengan kadar waktu yang cukup untuk bersuci dan melakukan salat.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Tawaf, Menetap di Masjid, dan Melewati Masjid",
      "paragraphs": [
        {
          "context": "Wanita haid atau nifas haram melakukan tawaf di Kabah. Dalilnya adalah sabda Rasulullah yang Artinya: \"Tawaf memiliki kedudukan seperti salat kecuali Allah membolehkan berbicara di dalamnya untuk berbicara. \"Diriwayatkan oleh Bukhori Muslim bahwa Rasulullah SAW bersabda kepada Aisyah ketika ia berhaji dalam keadaan haid yang Artinya: \"Lakukanlah segala hal yang diperbuat orang berhaji selain tawaf di Kabah.\"Para ulama bersepakat bahwa tawaf fardhu maupun sunnah hukumnya haram dan tidak sah bagi wanita haid atau nifas. Wanita haid atau nifas boleh melakukan segala hal dalam ibadah haji kecuali tawaf dan salat 2 rakaat tawaf. Wanita haid atau nifas haram menetap di masjid berdasarkan hadis Rasulullah yang Artinya :\"Sesungguhnya aku tak memperbolehkan masjid bagi orang yang haid dan junub.\" Begitu pula haram mondar-mandir di dalam masjid karena menyerupai menetap di masjid. Wanita haid atau nifas haram melewati masjid jika khawatir mengotorinya walaupun hanya perkiraan saja. Hal ini sebagai upaya berhati-hati. Diharamkan pula segala sesuatu yang kotor karena khawatir mengotori masjid. Jika tak khawatir mengotori masjid, maka hukumnya makruh.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Menyentuh dan Membawa Mushaf",
      "paragraphs": [
        {
          "context": "Artinya: \"Tak menyentuhnya (mushaf) kecuali orang-orang yang mensucikan dirinya.\" Dan hadis Rasulullah yang Artinya: \"Tak menyentuh Alquran kecuali orang yang suci.\" Maksud mushaf adalah bagian ayat Alquran yang tertulis walaupun hanya beberapa ayat yang dapat dipahami. Haram menyentuh mushaf walaupun dengan kain. Namun boleh membawa mushaf bersama benda lain jika berniat membawa benda tersebut saja. Jika berniat membawa mushaf saja maka hukumnya haram. Sedangkan jika berniat membawa keduanya atau tak berniat sama sekali maka boleh menurut Imam Romli. Dan sebaliknya menurut Ibnu Hajar.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Membaca Alquran dengan Niat Mengaji",
      "paragraphs": [
        {
          "context": "Wanita haid atau nifas haram membaca Alquran berdasarkan hadis Rasulullah yang Artinya: \"Tidaklah seorang yang junub dan haid membaca sesuatu dari Alquran.\" Wanita haram membaca Alquran ketika haid atau nifas dengan syarat: Pertama, membaca Alquran dengan niat mengaji saja atau dibarengi niat lainnya. Jika niat berdzikir, memberi nasihat, menyampaikan kisah, menjaga hapalan, atau menjaga diri tanpa dibarengi niat mengaji, maka tak diharamkan. Boleh pula membaca Alquran tanpa berniat apapun. Kedua, membaca Alquran dengan lafadz yang terdengar di telinganya. Maka boleh membaca Alquran dalam hati atau memandang mushaf tanpa menggerakkan lidah. Para ulama fikih bersepakat bahwa wanita haid atau nifas boleh bertasbih, bertahlil, dan berdzikir selain ayat Alquran.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Berpuasa, Haram Bercerai",
      "paragraphs": [
        {
          "context": "Para ulama bersepakat bahwa wanita haid atau nifas haram berpuasa karena hukumnya tak sah. Dalilnya adalah hadis yang diriwayatkan oleh Aisyah r.a. yang Artinya: \"Kami diperintahkan untuk mengqada puasa dan tak diperintahkan untuk mengqada salat.\" Hadis ini menunjukkan bahwa para wanita di zaman tersebut tidak berpuasa ketika sedang haid. Seorang suami haram menceraikan istrinya yang sedang haid berdasarkan firman Allah yang Artinya: \"Hai Nabi, apabila kamu menceraikan istri-istrimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat menghadapi iddahnya dan hitunglah jumlah iddah.\" Makna ayat: Jika kalian ingin bercerai maka ceraikanlah mereka dalam keadaan suci dan belum dikumpuli (baru suci dari haid). Dan makna 'hitunglah jumlah hari iddah' adalah agar kalian dapat merujuknya sebelum masa iddah berakhir. Ketika Ibnu Umar menceraikan istrinya dalam keadaan haid, Rasulullah SAW memerintahkannya untuk merujuknya dan menunda hingga istrinya suci. Alasannya adalah bercerai ketika haid merugikan wanita karena masa iddahnya bertambah panjang. Begitu pula suami haram menceraikan istri ketika suci dan telah dikumpuli. Hukum ini berlaku untuk perceraian tanpa imbalan (khuluk). Sedangkan jika istri memberi imbalan agar suami menceraikannya maka tak diharamkan.",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Bersuci dengan Niat Beribadah",
      "paragraphs": [
        {
          "context": "Seorang wanita haid atau nifas haram bersuci dengan niat beribadah. Yaitu niat mengangkat hadas, baik dengan berwudhu atau mandi. Jika ia mengetahui hal tersebut dan tetap melakukannya maka tidak sah dan berdosa. Karena ia bermain-main dengan ibadah. Sedangkan bersuci yang sunnah untuk membersihkan diri seperti mandi ihram, wukuf, dan melempar jumroh hukumnya sunnah bagi wanita haid tanpa ada perbedaan pendapat. Berdasarkan sabda Nabi SAW kepada Aisyah r.a. ketika ia haid, \"Lakukanlah segala hal yang dikerjakan orang yang haji kecuali tawaf.\"",
          "qas": []
        }
      ]
    },
    {
      "title": "Haram Berhubungan Suami Istri",
      "paragraphs": [
        {
          "context": "Para ulama fikih bersepakat hukumnya haram berhubungan suami istri ketika istri sedang haid. Sebagaimana firman Allah, \"Oleh sebab itu hendaklah kamu menjauhkan diri dari wanita di waktu haid; dan janganlah kamu mendekati mereka sebelum mereka suci. Apabila mereka telah suci, maka kumpulilah mereka di tempat yang diperintahkan Allah kepadamu. Sesungguhnya Allah menyukai orang yang bertaubat dan menyucikan dirinya.\" Begitu pula haram bersenang-senang dengan bagian tubuh antara pusar dan lutut. Berdasarkan hadis yang diriwayatkan Ibnu Majah dan Baihaqi bahwa Ibnu Umar bertanya kepada Rasulullah tentang hal-hal yang boleh diperbuat ketika istrinya sedang haid. Rasulullah SAW pun menjawab, \"Dengan anggota tubuh bagian atas sarung.\" (Maknanya adalah boleh bersenang-senang selain bagian antara pusar dan lutut). Para ulama fikih Syafi'i berbeda pendapat apakah yang diharamkan menyentuh bagian tubuh antara pusar dan lutut (mubasyaroh) atau bersenang-senang (Istimta)? Sebagian ulama berpendapat bahwa yang diharamkan adalah menyentuh bagian tubuh antara pusar dan lutut. Baik ia melakukannya dengan syahwat atau tidak. Namun boleh memandangnya walaupun dengan syahwat. Sebagian ulama lainnya berpendapat bahwa yang diharamkan adalah bersenang-senang antara pusar dan lutut. Maka haram untuk memandang dengan syahwat dan menyentuh dengan syahwat.",
          "qas": []
        }
      ]
    },
    {
      "title": "Hukum Wanita Istihadah",
      "paragraphs": [
        {
          "context": "Jika seorang wanita mengalami istihadah, maka ia dalam keadaan terus-menerus berhadas yang membatalkan wudhu. Namun darah tersebut tak mencegahnya untuk salat dan berpuasa. Maka ia wajib membersihkan darah, menyumbat, berwudhu di setiap salat fardhu, lalu melakukan salat. Jika seorang wanita istihadah berwudhu kemudian setelah atau ketika berwudhu atau ketika salat darah berhenti keluar, maka wajib ia berwudhu lagi dan seterusnya. Dengan syarat ketika darah berhenti, waktunya cukup untuk berwudhu dan salat. Sedangkan jika darah berhenti di waktu yang singkat, tak cukup untuk berwudhu dan salat, maka ia tak usah mengulangi wudhunya. Ia harus segera melakukan salat jika mempunyai kebiasaan darah keluar lagi dalam waktu singkat, atau orang yang berpengalaman mengatakan begitu. Kemudian jika darah tak keluar lagi dalam waktu singkat, terbukti bahwa wudhu dan salatnya batal, maka ia harus berwudhu lagi dalam keadaan darah berhenti. Sedangkan jika ia tak mempunyai kebiasaan darah keluar lagi di waktu yang cukup untuk berwudhu dan salat, atau orang yang berpengalaman mengatakan begitu, maka ia tak boleh salat dengan wudhu tersebut.",
          "qas": []
        }
      ]
    },
    {
      "title": "Kewajiban Wanita Istihadah Ketika Akan Salat",
      "paragraphs": [
        {
          "context": "Pertama, membasuh kemaluan sebelum berwudhu. Kedua, menyumbat kemaluan dengan kapas untuk menghambat/meringankan najis. Ketiga, memakai pembalut. Keempat, berwudhu dilakukan setelah masuk waktu salat. Kelima, berkesinambungan dalam melakukan langkah-langkah di atas. Keenam, berwudhu di setiap salat fardhu. Menyumbat kemaluan dengan kapas wajib dengan syarat tidak merasa kesakitan yang berlebihan, tidak sedang berpuasa, dan ia butuh menyumbat kemaluannya.  Pembalut wajib dengan syarat ia butuh memakai pembalut karena darah tetap mengalir setelah disumbat dan tidak merasa kesakitan yang berlebihan. Ya cukup hanya memakai pembalut jika bisa menghambat darah menurut pendapat Imam Romli. Darah yang keluar setelah memakai pembalut tak berdampak kecuali jika ia kurang kencang atau tepat dalam memasangnya. Tidak boleh berwudhu sebelum masuk waktu salat karena ia bersuci dalam keadaan darurat. Ia wajib segera menyumbat kemaluan setelah membasuhnya, kemudian segera memakai pembalut, lalu berwudhu dan salat. Tak boleh menunda salat karena hal lain kecuali yang berhubungan dengan salat, misal menutup aurat, menunggu jamaah, menjawab adzan, iqomat, salat sunnah qobliyah. Jika ia menunda salat selain hal ini maka ia wajib mengulangi seluruh langkah. Ia wajib mengulangi membasuh kemaluan, menyumbat, dan memakai pembalut di setiap salat fardhu menurut pendapat paling kuat. Wanita istihadah boleh melakukan salat sunnah sesuai keinginannya pada waktunya atau setelahnya.",
          "qas": []
        }
      ]
    },
    {
      "title": "Darah Kuat dan Lemah",
      "paragraphs": [
        {
          "context": "Darah kuat dan lemah diketahui dari warnanya. Darah paling kuat berwarna hitam dan darah yang mengandung garis berwarna hitam. Lalu merah, coklat, kuning, dan keruh. Darah kuat dan lemah dapat diketahui pula dari kekentalan dan bau yang tak enak. Darah yang memiliki 3 sifat (warna, kekentalan, dan bau yang tak enak) lebih kuat daripada darah yang hanya memiliki 2 sifat. Sedangkan 2 sifat lebih kuat dari 1 sifat saja. Jika setara seperti hitam kental dan hitam berbau menyengat, maka haidnya adalah darah hitam yang pertama. Hukum darah kuat diikuti dua darah lemah yaitu Jika seorang wanita mengeluarkan darah kuat, lalu lemah, lalu lebih lemah, maka darah kuat dan lemah adalah haid dengan tiga syarat: Pertama, didahului darah kuat terlebih dahulu. Kedua, kedua jenis darah jika dikumpulkan tak lebih dari 15 hari. Ketiga, darah kuat bersambung dengan darah lemah, bukan bersambung dengan darah yang lebih lemah.",
          "qas": []
        }
      ]
    },
    {
      "title": "Syarat Tamyiz",
      "paragraphs": [
        {
          "context": "Syarat Tamyiz: Pertama, darah kuat 24 jam (masa minimal haid). Jika kurang dari 24 jam maka termasuk ghoiru mumayyizah. Kedua, darah kuat maksimal 15 hari (masa maksimal haid). Jika melebihi 15 hari maka termasuk ghoiru mumayyizah. Ketiga, darah lemah lebih dari 15 hari (masa minimal suci) jika darah terus-menerus keluar. Jika darah berhenti, seperti suci setelahnya, maka syarat ini tak berlaku. Keempat, darah yang lemah bersambung. Jika tak bersambung maka termasuk ghoiru mumayyizah. Maksud bersambung: tidak disela-sela darah kuat. Syarat tamyiz ini tujuannya menjadikan darah kuat sebagai haid dan darah lemah suci.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mubtada'ah Mumayyizah (Haid)",
      "paragraphs": [
        {
          "context": "Pertama kali haid dan sifat darah dapat dibedakan. Makna mubtada'ah: wanita yang pertama kali mengeluarkan darah haid. Makna mumayyizah: Mengeluarkan darah dalam dua sifat yaitu kuat dan lemah. Hukumnya: darah kuat adalah haid sedangkan darah lemah adalah istihadah. Seseorang dihukumi mumayyizah jika memenuhi syarat-syarat tamyiz. Dalilnya adalah perkataan Rasulullah SAW kepada Fatimah binti Abi Hubaisy ketika ia mengalami istihadah yang Artinya: \"Jika darah haid maka adalah darah yang berwarna hitam sebagaimana yang telah diketahui. Apabila semacam itu maka janganlah melakukan salat. Namun Jika tak semacam itu maka berwudhulah dan salatlah karena itu adalah irq (istihadah).\" Sedangkan di bulan kedua dan berikutnya, jika darah kuat diikuti darah lemah, maka ia wajib mandi ketika memasuki darah lemah. Dan ia melakukan salat, berpuasa, dan boleh berhubungan suami istri tanpa menunggu berlalunya 15 hari karena bulan sebelumnya ia mengalami istihadah dan bulan ini dianggap seperti bulan sebelumnya.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mubtada'ah Ghoiru Mumayyizah (Haid)",
      "paragraphs": [
        {
          "context": "Terdapat 2 macam: Pertama, mengeluarkan darah dengan satu sifat. Seperti berwarna hitam atau merah saja. Kedua, mengeluarkan darah lebih dari 1 sifat namun tak memenuhi syarat-syarat tamyiz. Hukumnya: Haidnya adalah sehari semalam dan suci selama 29 hari. Dalilnya adalah selama sehari semalam ia haid secara yakin sedangkan setelahnya ragu. Ketika seorang wanita mengeluarkan darah haid untuk pertama kalinya, maka ia tak boleh salat. Jika darah terus keluar hingga melebihi 15 hari dan sifatnya ghoiru mumayyizah, maka ia wajib mandi dan salat. Hal ini dilakukan jika darah terus-menerus keluar seperti sifat sebelumnya atau berubah ke sifat yang lebih lemah. Namun jika berubah ke sifat yang lebih kuat, hendaknya ia bersabar karena darah mungkin berhenti dan ia dihukumi mumayyizah. Maka di bulan kedua ia wajib melakukan hal-hal seperti di bulan pertama. Kemudian jika ternyata darah berhenti sebelum 15 hari, maka ia tak mengalami istihadah di bulan ini.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mu'tadah Mumayyizah (Haid)",
      "paragraphs": [
        {
          "context": "Mu'tadah: Wanita yang pernah mengalami haid dan suci serta ingat jumlah harinya. Mumayyizah: Mengeluarkan darah dengan sifat kuat dan lemah dan memenuhi syarat-syarat tamyiz. Hukumnya adalah berdasarkan tamyiz yaitu darah kuat adalah haid dan darah lemah istihadah. Syarat menghukumi dengan tamyiz dan mengabaikan kebiasaan yaitu Tidak disela-sela antara kebiasaan dan tamyiz dengan masa minimal suci. Jika disela-sela masa minimal suci, maka darah kuat adalah haid yang baru.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mu'tadah Ghoiru Mumayyizah (Haid)",
      "paragraphs": [
        {
          "context": "Mu'tadah: Wanita yang pernah mengalami haid dan suci serta ingat jumlah harinya. Ghoiru Mumayyizah: Mengeluarkan darah dalam satu sifat atau lebih dari 1 sifat namun ia tak memenuhi syarat-syarat tamyiz. Hukumnya: Dikembalikan ke kebiasaannya dalam haid dan suci. Dalilnya adalah ketika seorang wanita mengeluarkan darah di zaman Rasulullah SAW lalu Ummu Salamah bertanya kepada Rasulullah SAW dan dijawab yang artinya: \"Lihatlah jumlah hari dan malam dari haid di bulan sebelumnya, maka tinggalkanlah salat sesuai jumlah hari haid yang terakhir.\" Cara menentukan kebiasaan haid: Pertama, jika kebiasaan haid seorang wanita berbeda namun teratur maka kebiasaan ini ditetapkan setelah terjadi dua kali. Kedua, kebiasaan ditentukan dengan tamyiz sebagaimana ditentukan oleh berhentinya darah. Ketiga, maksud dari kebiasaan haid adalah kebiasaan seseorang dalam haid dan suci dan total hari keduanya dinamakan daur. Keempat, kebiasaan haid dapat berpindah maju atau mundur, bertambah atau berkurang. Maka hukumnya dikembalikan ke haid terakhir karena paling dekat dengan bulan ia mengalami istihadah. Wanita mu'tadah jika terus-menerus mengeluarkan darah hingga bulan kedua dan melebihi kebiasaan haidnya, maka hendaknya ia mandi setelah melewati kebiasaannya karena di bulan pertama ia telah mengalami istihadah. Ia boleh melakukan salat, puasa, dan lainnya seperti wanita suci. Hal ini dilakukan setiap bulan. Jika suatu ketika darah berhenti di hari ke-15 atau kurang, maka ia tak mengalami istihadah di bulan ini. Dan keseluruhan darah adalah haid. Ia wajib mengqada puasa dan lainnya yang dilakukan di waktu tersebut.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh Muthlaqoh (Haid)",
      "paragraphs": [
        {
          "context": "Yaitu wanita yang lupa kebiasaan haidnya (jumlah hari dan waktu) dan sifat darah tak bisa dibedakan (ghoiru mumayyizah) atau lupa awal daur. Sebab lupa: karena lalai, cuek, sakit yang berkepanjangan, atau gila. Hukumnya ia wajib berhati-hati karena setiap waktu memiliki kemungkinan haid dan suci. Tak mungkin ia dalam keadaan selalu suci atau selalu haid. Makna berhati-hati adalah ia dihukumi seperti wanita haid di beberapa hal dan dihukumi seperti wanita suci di beberapa hal. Diharamkan baginya sebagaimana wanita haid: Bersenang-senang antara pusar dan lutut, Membaca alquran di luar salat, Menyentuh mushaf, Membawa mushaf, Menetap di masjid, Melewati masjid jika takut mengotorinya. Diperbolehkan baginya sebagaimana wanita suci: Salat, Tawaf, Puasa, Bercerai, Mandi dengan niat ibadah. Cara Bersuci jika diketahui waktu berakhirnya haid di bulan sebelumnya, maka ia wajib mandi setiap hari setelah waktu tersebut, sedangkan untuk waktu salat lainnya cukup dengan berwudhu saja. Namun jika tak mengetahui waktu berakhirnya haid, maka wajib mandi di setiap salat fardhu dan tak harus langsung melakukan salat setelah mandi. Jika tak mungkin mandi dengan menyelam, maka ia wajib mengurutkan anggota wudhu di pertengahan mandi. Salat wanita mutahayyiroh: wajib melakukan salat 5 waktu, boleh melakukan salat jenazah, salat sunnah rowatib atau selainnya. Puasa Wanita Mutahayyiroh: wajib puasa ramadan sebulan penuh. Sebab ada kemungkinan ia dalam keadaan suci selama bulan ramadan. Kemudian ia berpuasa lagi selama sebulan penuh di bulan yang lain.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh Ingat Waktu Tetapi Lupa Jumlah Hari (Haid)",
      "paragraphs": [
        {
          "context": "Ketika ia yakin dalam keadaan haid maka berlaku hukum wanita haid. Dan ketika ia yakin dalam keadaan suci maka berlaku hukum wanita suci. Ketika ia ragu haid atau suci maka hukumnya seperti wanita haid di dalam berhubungan suami istri, menyentuh mushaf, membaca alquran di luar salat. Dan hukumnya seperti wanita suci di dalam ibadah yang membutuhkan niat. Ketika ia berada di waktu yang memiliki kemungkinan darah berhenti, maka ia wajib mandi di setiap salat fardhu. Selain di waktu tersebut ia cukup berwudhu.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh ingat jumlah hari tetapi lupa waktu (Haid)",
      "paragraphs": [
        {
          "context": "Ketika ia yakin dalam keadaan haid maka berlaku hukum wanita haid. Ketika ia yakin dalam keadaan suci maka berlaku hukum wanita suci. Ketika ia ragu haid atau suci maka ia wajib berhati-hati. Ketika ia ragu haid atau suci atau darah berhenti maka ia wajib mandi di setiap salat fardhu karena ada kemungkinan darah haid telah berhenti sebelumnya. Namun jika diketahui darah berhenti di waktu tertentu, seperti siang atau malam hari, maka ia cukup mandi di waktu tersebut saja setiap hari. Dua syarat yang harus dipenuhi, yaitu mengetahui jumlah hari daur dan mengetahui awal daur.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mubtada'ah Mumayyizah (Nifas)",
      "paragraphs": [
        {
          "context": "Mubtada'ah: Wanita yang belum pernah mengalami nifas. Mumayyizah: Mengeluarkan darah dalam sifat kuat dan lemah. Hukumnya: Darah kuat adalah nifas dengan syarat darah yang kuat maksimal 60 hari. Darah lemah adalah suci walaupun lama masanya. Dibahas pula permasalahan mumayyizah dalam haid. Disyaratkan bahwa kedua darah tak didahului oleh masa suci 15 hari atau lebih. Jika didahului masa suci 15 hari atau lebih maka darah yang keluar setelahnya adalah haid.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mubtada'ah Ghoiru Mumayyizah (Nifas)",
      "paragraphs": [
        {
          "context": "Mubtada'ah: Wanita yang belum pernah mengalami nifas. Ghoiru mumayyizah: Mengeluarkan darah dengan satu sifat, atau tidak memenuhi syarat tamyiz dengan mengeluarkan darah kuat melebihi 60 hari. Hukumnya: Nifasnya sekejap berdasarkan masa minimal nifas. Kemudian kita lihat apakah ia mubtada'ah atau mu'tadah di dalam haid. Jika ia mu'tadah dalam haid, maka setelah masa sekejap tersebut ia dihukumi suci sesuai kebiasaan suci dari haid. Lalu ia dihukumi haid sesuai kebiasaan haidnya. Jika ia mubtada'ah dalam haid, maka setelah masa sekejap ia dihukumi suci selama 29 hari. Lalu ia haid selama sehari semalam dan suci 29 hari dan seterusnya.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mu'tadah Mumayyizah (Nifas)",
      "paragraphs": [
        {
          "context": "Mu'tadah: Wanita yang pernah mengalami nifas. Mumayyizah: Mengeluarkan darah dalam sifat kuat dan lemah. Hukumnya: Darah kuat adalah nifas sedangkan lemah istihadah. Dibahas pula permasalahan mubtada'ah mumayyizah dalam haid. Di antaranya ialah terpenuhinya syarat tamyiz yaitu darah kuat tak melebihi 60 hari.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mu'tadah Ghoiru Mumayyizah (Nifas)",
      "paragraphs": [
        {
          "context": "Mu'tadah: Wanita yang pernah mengalami nifas. Ghoiru mumayyizah: Mengeluarkan darah dalam satu sifat atau tak memenuhi syarat tamyiz yaitu darah kuat melebihi 60 hari. Hukumnya: Dikembalikan ke kebiasaan nifas dan kebiasaan suci dari haid. Kemudian ia mengalami haid sesuai kebiasaannya jika mu'tadah dalam haid. Jika tidak maka ia mubtada'ah dalam haid.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh Muthlaqoh (Nifas)",
      "paragraphs": [
        {
          "context": "Yaitu seorang wanita yang lupa kebiasaan waktu dan jumlah hari di dalam nifas. Hukumnya: Ia senantiasa dalam keadaan berhati-hati baik ia mubtada'ah atau mu'tadah dalam haid. Sebabnya adalah ia tak tahu kebiasaan nifasnya sehingga ia pun tak tahu kapan awal daur haidnya. Maka ia dihukumi mutahayyiroh muthlaqoh. Disini berlaku seluruh pembahasan wanita istihadah di dalam haid mutahayyiroh muthlaqoh dan ia wajib mandi di setiap salat fardhu dan seterusnya.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh ingat waktu tetapi lupa jumlah hari (Nifas)",
      "paragraphs": [
        {
          "context": "Misalnya seorang wanita berkata, \"Aku dahulu mengalami nifas setelah melahirkan namun aku lupa jumlah harinya.\" Hukumnya: Sekejap setelah melahirkan adalah nifas secara yakin. Setelah itu ia dihukumi ragu nifas atau suci atau darah berhenti maka ia wajib untuk mandi di setiap salat fardhu.",
          "qas": []
        }
      ]
    },
    {
      "title": "Mutahayyiroh ingat jumlah hari tetapi lupa waktu (Nifas)",
      "paragraphs": [
        {
          "context": "Misalnya seorang wanita berkata, \"Aku dahulu mengalami nifas 10 hari. Namun aku lupa apakah dimulai setelah melahirkan atau sebelum berlalunya 15 hari setelah melahirkan. Dan nifasku selesai sebelum berlalunya 25 hari.\" Hukumnya: Sepuluh hari setelah melahirkan ia dihukumi ragu nifas atau suci. Lalu hari ke-11 hingga hari ke-24 ia dihukumi ragu nifas atau suci atau darah berhenti. Sedangkan hari ke-25 yakin dalam keadaan suci. Setelah hari ke-25 ia dihukumi ragu haid atau suci selama sehari semalam jika mubtada'ah. Dan berdasarkan kebiasaannya jika ia mu'tadah. Setelah itu ia dihukumi ragu haid/suci/darah berhenti maka ia wajib untuk mandi di setiap salat fardhu.",
          "qas": []
        }
      ]
    }
  ]
}
